alextaras88/LPC1114Start-for-SeggerES/ssd1306.h
#ifndef SSD1306_H_
#define SSD1306_H_


/****************************************************/
#include "LPC11xx.h"
#include "i2c.h"
#include "delay.h"
#include "ssd1306_fonts.h"

/****************************************************/
#define SSD1306_I2C_ADDR        (0x3C)

// SSD1306 OLED height in pixels

#define SSD1306_HEIGHT          64   //64

// SSD1306 width in pixels

#define SSD1306_WIDTH           128

// some LEDs don't display anything in first two columns
// #define SSD1306_WIDTH           130
/****************************************************/
// Enumeration for screen colors
typedef enum {
    Black = 0x00, // Black color, no pixel
    White = 0x01  // Pixel is set. Color depends on OLED
} SSD1306_COLOR;

// Struct to store transformations
typedef struct {
    uint16_t CurrentX;
    uint16_t CurrentY;
    uint8_t Inverted;
    uint8_t Initialized;
} SSD1306_t;
/****************************************************/
// Procedure definitions
void ssd1306_Init(void);
void ssd1306_Fill(SSD1306_COLOR color);
void ssd1306_UpdateScreen(void);
void ssd1306_DrawPixel(uint8_t x, uint8_t y, SSD1306_COLOR color);
char ssd1306_WriteChar(char ch, FontDef Font, SSD1306_COLOR color);
char ssd1306_WriteString(char* str, FontDef Font, SSD1306_COLOR color);
void ssd1306_SetCursor(uint8_t x, uint8_t y);

// Low-level procedures
void ssd1306_Reset(void);
void ssd1306_WriteCommand(uint8_t byte);
void ssd1306_WriteData(uint8_t* buffer, uint16_t buff_size);
/****************************************************/

#endif /* SSD1306_H_ */

